# =============================================================================
# Railroad Language File - French (fr_fr)
# =============================================================================

# =============================================================================
# GENERIC/COMMON
# =============================================================================
railroad.generic.apply=Appliquer
railroad.generic.ok=Ok
railroad.generic.cancel=Annuler
railroad.generic.close=Fermer
railroad.generic.back=Retour
railroad.generic.next=Suivant
railroad.generic.finish=Terminer

# =============================================================================
# APPLICATION
# =============================================================================
railroad.app.name=Railroad
railroad.app.version=1.0.0 (dev)

# =============================================================================
# WINDOW TITLES
# =============================================================================
railroad.home.window.title=Railroad
railroad.ide.window.title=Railroad IDE

# =============================================================================
# HOME/WELCOME SCREEN
# =============================================================================
railroad.home.welcome.greeting=Bienvenue dans Railroad !
railroad.home.welcome.projects=Liste des projets
railroad.home.welcome.projects.subtitle=Gérez vos projets facilement
railroad.home.welcome.projects.empty=Aucun projet encore ! Créez votre premier projet.
railroad.home.welcome.projectsearch=Rechercher des projets...
railroad.home.welcome.projectsearch.subtitle=Rechercher des projets
railroad.home.welcome.home=Accueil
railroad.home.welcome.openproject=Ouvrir le projet
railroad.home.welcome.newproject=Nouveau projet
railroad.home.welcome.importproject=Importer le projet
railroad.home.welcome.settings=Paramètres

# Project sorting
railroad.home.welcome.sort.none=Aucun
railroad.home.welcome.sort.name=Nom
railroad.home.welcome.sort.date=Date

# Project actions
railroad.home.welcome.project.open=Ouvrir
railroad.home.welcome.project.remove=Supprimer
railroad.home.welcome.project.searchtype=Rechercher des types de projets

# =============================================================================
# SETTINGS
# =============================================================================
railroad.home.settings.title=Paramètres
railroad.home.settings.description=Configurez vos paramètres ici.
railroad.home.settings.search=Rechercher des paramètres...
railroad.home.settings.back=Retour

# Settings categories
railroad.general=Général
railroad.appearance=Apparence
railroad.ide=IDE

# General settings
railroad.general.language.title=Langue
railroad.general.language.description=Sélectionnez la langue pour l'interface Railroad.
railroad.general.project_folder.title=Dossier de projet par défaut

# GitHub connection
railroad.home.settings.general.github=Connexion à Github :
railroad.home.settings.general.github.connect=Connecter
railroad.home.settings.general.github.disconnect=Déconnecter

# Appearance settings
railroad.appearance.themes=Thèmes
railroad.appearance.themes.description=Personnalisez l'apparence de Railroad en sélectionnant parmi les thèmes disponibles ou en téléchargeant de nouveaux depuis le dépôt de thèmes.
railroad.appearance.themes.download_repo.title=Dépôt personnalisé
railroad.appearance.themes.download_repo.description=Spécifiez une URL de dépôt GitHub pour télécharger des thèmes.
railroad.appearance.themes.select.title=Thème
railroad.appearance.themes.select.description=
railroad.appearance.language.language.title=Langue

# Theme management
railroad.home.settings.appearance.theme=Sélectionner un thème
railroad.home.settings.appearance.downloadtheme=Télécharger les thèmes
railroad.home.settings.appearance.downloadtheme.description=Parcourez et téléchargez des thèmes depuis le dépôt officiel de thèmes Railroad.
railroad.home.settings.appearance.notfound=Thèmes non trouvés
railroad.home.settings.appearance.loading=Chargement des thèmes...
railroad.home.settings.appearance.themes=Thèmes disponibles
railroad.home.settings.appearance.themes.found=%d thèmes trouvés
railroad.home.settings.appearance.download=Télécharger
railroad.home.settings.appearance.installed=Installé
railroad.home.settings.appearance.preview=Aperçu
railroad.home.settings.appearance.preview.error=Échec du chargement de l'aperçu
railroad.home.settings.appearance.preview.loaded=Aperçu chargé
railroad.home.settings.appearance.selecttheme=Sélectionner un thème

# Theme preview
railroad.home.settings.appearance.preview.title=Aperçu du thème
railroad.home.settings.appearance.preview.subtitle=Cet aperçu montre comment divers composants d'interface utilisateur apparaîtront avec le thème sélectionné.
railroad.home.settings.appearance.preview.form.components=Composants de formulaire
railroad.home.settings.appearance.preview.list.components=Composants de liste
railroad.home.settings.appearance.preview.button.components=Composants de bouton
railroad.home.settings.appearance.preview.close=Fermer l'aperçu
railroad.home.settings.appearance.preview.apply=Appliquer le thème

# Keymaps
railroad.home.settings.keymaps.key=Touche
railroad.home.settings.keymaps.action=Action
railroad.home.settings.keymaps.action.runproject=Exécuter le projet
railroad.home.settings.keymaps.action.termproject=Terminer le projet

# IDE settings
railroad.ide.auto_pair_inside_strings.title=Auto-appariement dans les chaînes
railroad.ide.auto_pair_inside_strings.description=Activer ou désactiver l'auto-appariement des crochets et guillemets dans les chaînes.

# =============================================================================
# PROJECT CREATION
# =============================================================================
railroad.home.project=Projet
railroad.home.project.browse=Parcourir
railroad.home.project.create=Créer
railroad.home.project.creating=Création du projet...

# Project basic info
railroad.project.creation.name=Nom
railroad.project.creation.name.prompt=Entrez le nom du projet
railroad.project.creation.name.error.required=Vous devez entrer un nom de projet
railroad.project.creation.name.error.length_long=Le nom du projet est trop long
railroad.project.creation.name.error.length_short=Le nom du projet est trop court
railroad.project.creation.name.error.invalid_characters=Le nom du projet contient des caractères invalides

railroad.project.creation.location=Emplacement
railroad.project.creation.location.error.required=Vous devez entrer un emplacement de projet
railroad.project.creation.location.error.invalid_characters=L'emplacement du projet contient des caractères invalides
railroad.project.creation.location.error.not_exists=L'emplacement du projet n'existe pas
railroad.project.creation.location.error.not_directory=L'emplacement du projet n'est pas un répertoire
railroad.project.creation.location.error.invalid_path=L'emplacement du projet est invalide
railroad.project.creation.location.warning.onedrive=Il n'est pas recommandé de créer des projets dans OneDrive car cela a tendance à causer des problèmes.
railroad.project.creation.location.info=Cela sera créé à : %s

railroad.project.creation.git=Créer un dépôt Git

railroad.project.creation.license=Licence
railroad.project.creation.license.custom=Licence personnalisée
railroad.project.creation.license.custom.prompt=Entrez une licence personnalisée
railroad.project.creation.license.custom.error.required=Vous devez entrer une licence personnalisée

# Minecraft settings
railroad.project.creation.minecraft_version=Version de Minecraft
railroad.project.creation.forge_version=Version de Forge
railroad.project.creation.fabric_loader_version=Version du chargeur Fabric
railroad.project.creation.include_fapi=Inclure l'API Fabric
railroad.project.creation.fabric_api_version=Version de l'API Fabric

# Mod settings
railroad.project.creation.mod_id=ID du mod
railroad.project.creation.mod_id.prompt=Entrez l'ID du mod
railroad.project.creation.mod_id.error.required=Vous devez entrer un ID de mod
railroad.project.creation.mod_id.error.length_short=L'ID du mod est trop court
railroad.project.creation.mod_id.error.length_long=L'ID du mod est trop long
railroad.project.creation.mod_id.error.invalid_characters=L'ID du mod contient des caractères invalides

railroad.project.creation.mod_name=Nom du mod
railroad.project.creation.mod_name.prompt=Entrez le nom du mod
railroad.project.creation.mod_name.error.required=Vous devez entrer un nom de mod
railroad.project.creation.mod_name.error.length_long=Le nom du mod est trop long

railroad.project.creation.main_class=Classe principale
railroad.project.creation.main_class.prompt=Entrez le nom de la classe principale
railroad.project.creation.main_class.error.required=Vous devez entrer le nom de la classe principale
railroad.project.creation.main_class.error.invalid_characters=Le nom de la classe principale contient des caractères invalides

# Project features
railroad.project.creation.use_mixins=Utiliser Mixins
railroad.project.creation.use_access_transformer=Utiliser Access Transformer
railroad.project.creation.use_access_widener=Utiliser Access Widener
railroad.project.creation.gen_run_folders=Générer les dossiers d'exécution
railroad.project.creation.split_sources=Diviser les sources

# Mappings
railroad.project.creation.mapping_channel=Canal de mappage
railroad.project.creation.mapping_version=Version de mappage

# Project metadata
railroad.project.creation.author=Auteur
railroad.project.creation.author.prompt=Entrez le nom de l'auteur
railroad.project.creation.author.error.length_long=Le nom de l'auteur est trop long

railroad.project.creation.credits=Crédits
railroad.project.creation.credits.prompt=Entrez les crédits
railroad.project.creation.credits.error.length_long=Les crédits sont trop longs

railroad.project.creation.description=Description
railroad.project.creation.description.prompt=Entrez la description
railroad.project.creation.description.error.length_long=La description est trop longue

# URLs
railroad.project.creation.issues=URL des problèmes
railroad.project.creation.issues.prompt=Entrez l'URL des problèmes
railroad.project.creation.issues.error.length_long=L'URL des problèmes est trop longue
railroad.project.creation.issues.error.invalid_url=L'URL des problèmes est invalide

railroad.project.creation.update_json_url=URL de mise à jour JSON
railroad.project.creation.update_json_url.prompt=Entrez l'URL de mise à jour JSON
railroad.project.creation.update_json_url.error.length_long=L'URL de mise à jour JSON est trop longue
railroad.project.creation.update_json_url.error.invalid_url=L'URL de mise à jour JSON est invalide

railroad.project.creation.display_url=URL d'affichage
railroad.project.creation.display_url.prompt=Entrez l'URL d'affichage
railroad.project.creation.display_url.error.length_long=L'URL d'affichage est trop longue
railroad.project.creation.display_url.error.invalid_url=L'URL d'affichage est invalide

railroad.project.creation.homepage=URL de la page d'accueil
railroad.project.creation.homepage.prompt=Entrez l'URL de la page d'accueil
railroad.project.creation.homepage.error.length_long=L'URL de la page d'accueil est trop longue
railroad.project.creation.homepage.error.invalid_url=L'URL de la page d'accueil est invalide

railroad.project.creation.sources=URL des sources
railroad.project.creation.sources.prompt=Entrez l'URL des sources
railroad.project.creation.sources.error.length_long=L'URL des sources est trop longue
railroad.project.creation.sources.error.invalid_url=L'URL des sources est invalide

# Project options
railroad.project.creation.display_test=Test d'affichage
railroad.project.creation.client_side_only=Côté client uniquement

# Maven settings
railroad.project.creation.group_id=ID du groupe
railroad.project.creation.group_id.prompt=Entrez l'ID du groupe
railroad.project.creation.group_id.error.required=Vous devez entrer un ID de groupe
railroad.project.creation.group_id.error.length_long=L'ID du groupe est trop long
railroad.project.creation.group_id.error.invalid_characters=L'ID du groupe contient des caractères invalides

railroad.project.creation.artifact_id=ID de l'artefact
railroad.project.creation.artifact_id.prompt=Entrez l'ID de l'artefact
railroad.project.creation.artifact_id.error.required=Vous devez entrer un ID d'artefact
railroad.project.creation.artifact_id.error.length_long=L'ID de l'artefact est trop long
railroad.project.creation.artifact_id.error.invalid_characters=L'ID de l'artefact contient des caractères invalides

railroad.project.creation.version=Version
railroad.project.creation.version.prompt=Entrez la version
railroad.project.creation.version.error.required=Vous devez entrer une version
railroad.project.creation.version.error.length_long=La version est trop longue
railroad.project.creation.version.error.invalid_characters=La version contient des caractères invalides

# Project creation sections
railroad.project.creation.section.project=Projet
railroad.project.creation.section.minecraft=Minecraft
railroad.project.creation.section.optional=Optionnel
railroad.project.creation.section.mappings=Mappages
railroad.project.creation.section.maven=Maven

# =============================================================================
# IDE
# =============================================================================
railroad.ide.welcome.message=Bienvenue dans Railroad !
railroad.ide.welcome.message.description=Pour commencer, créez un nouveau fichier ou ouvrez-en un existant.
railroad.ide.welcome.features=Fonctionnalités

railroad.ide.welcome.feature.model_viewer_editor=Visualiseur et éditeur de modèles
railroad.ide.welcome.feature.structure_viewer_editor=Visualiseur et éditeur de structures
railroad.ide.welcome.feature.texture_viewer_editor=Visualiseur et éditeur de textures
railroad.ide.welcome.feature.sound_visualizer=Visualiseur de son
railroad.ide.welcome.feature.mixin_support=Support Mixin

railroad.ide.welcome.getting_started=Premiers pas
railroad.ide.welcome.getting_started.description=Apprenez à utiliser Railroad avec notre wiki et nos tutoriels.
railroad.ide.welcome.getting_started.wiki=Wiki
railroad.ide.welcome.getting_started.tutorials=Tutoriels

railroad.ide.project_explorer.search_field=Rechercher des fichiers...

# =============================================================================
# DIALOGS
# =============================================================================
railroad.dialog.open_project.title=Ouvrir le projet
railroad.dialog.open_project.error.invalid_directory=Répertoire de projet invalide
railroad.dialog.open_project.error.invalid_directory.message=Le répertoire sélectionné ne semble pas être un projet valide. Veuillez sélectionner un répertoire contenant un projet valide.
